app/controllers/prices_controller.rb

SELECT "diesel_prices".* FROM "diesel_prices" ORDER BY "diesel_prices"."id" DESC LIMIT 1
SELECT "regular_prices".* FROM "regular_prices" ORDER BY "regular_prices"."id" DESC LIMIT 1
---
	def get
		respond_to do |format|
			format.html { redirect_to :index }
			format.xml { render :xml => { :regular => RegularPrice.last, :diesel => DieselPrice.last }.to_xml }